"Eamon Leonard, founder of Broadstone VC, Baseline, and 'this next thing,' joined Gary Fox on the Entrepreneur Experiment podcast to discuss intentional networking, event planning, and the power of bringing people together. The conversation centered around a unique event Eamon organized in Switzerland, which served as a springboard for broader insights into entrepreneurship and ecosystem building.

The Switzerland Event: A Masterclass in Intentional Networking

Eamon described a meticulously planned gathering he organized in Switzerland for about 150 people who 'like to build stuff.' Co-organized with Paul Campbell and Abby Phoenix, the event was designed to facilitate connections in a comfortable setting. Eamon explained, 'We wanted a place that would fit about 150 people comfortably... We wanted a space that would kind of facilitate [connections] and that people wouldn't have to think too hard about activities or meals.'

The gathering had a unique structure, starting in three different cities (Zurich, Innsbruck, and Milan) before converging at the Grand Hotel Kronenhof in a small Swiss village. This approach was designed to create shared experiences from the start. Eamon noted, 'You're creating shared experiences from the minute you arrive.'

The event was intentionally designed to be difficult to describe, aiming for a 'you just have to be there' feeling. This approach highlights Eamon's philosophy on effective networking: creating experiences that foster genuine connections rather than transactional interactions.

Networking Philosophy and Event Planning Insights

Eamon shared his perspective on effective networking: 'If you're certainly if you're early in your career, it can be one of the fastest ways of leveling up or getting to know people quickly.' He encouraged organizing small, intentional gatherings as a way to build networks organically, contrasting this with transactional networking:

'This is where networking can be good as opposed to the transactional type of networking that lots of people have experienced with and probably come away with negative thoughts on it because it feels like transactional.'

In discussing the event planning process, Eamon emphasized the importance of meticulous attention to detail and infusing personality into events:

'Being having kind of our DNA or fingerprints on the experiences I think was important to us and I would encourage anybody that organizes events to really think about how to be they very small ones or large ones think about how how you know your personality and that of your team is imbued into into the experience.'

Notable Stories and Anecdotes

1. The Origin Story: Eamon traced the roots of the Switzerland event to previous events he and Paul had organized in Ireland, including a conference on party buses and in a castle.

2. The Wham! Chalet: A friend who had attended their previous events had purchased a chalet in Switzerland - the same one featured in Wham!'s 'Last Christmas' video. This sparked the idea for the Swiss gathering, although they quickly realized the chalet was too small and expanded their vision.

3. Family-Friendly Atmosphere: The event was family-friendly, with about 15-16 kids attending. Eamon initially resisted this idea but came to appreciate it: 'It was Paul's original suggestion to to make it kind of family friendly and I definitely was resistant to the idea... he eventually convinced me and it was it was the right call.'

Investment Philosophy and Pre-seed Investments

Eamon and his partner started a small syndicate called Broadstone, focusing on pre-seed investments. He explained that pre-seed typically refers to investments ranging from $500,000 to $1.5 million, used to get startups up and running. At this stage, there's little concrete evidence of success, so investors primarily focus on the founders themselves.

Key factors they look for in founders include:

a) Clarity of communication and thought about the product
b) Motivation and suitability of the founders for the specific problem and market
c) Ability to think intentionally and act with urgency
d) Willingness to learn from mistakes and adapt quickly

Eamon emphasized the importance of spending quality time with founders to understand their thinking on various aspects of the business. He also stressed that the founder-investor relationship should be a two-way street, advising founders to interview investors and assess if they trust them, especially for support during difficult times.

Investment Focus and AI Skepticism

Eamon expressed a preference for investing in areas where they can provide value beyond just capital, avoiding unfamiliar sectors like non-consumer e-commerce. He shared his skepticism about the sudden surge in AI-focused investments, believing AI will primarily augment existing technologies rather than create entirely new startups in most cases.

Investment Cycles and Ecosystem Development

Eamon identified recurring cycles in tech investment, each lasting about 4-5 years with overlapping trends, such as Web 1.0, social web, cloud computing, mobile, big data, machine learning, and cryptocurrency. He advocated for a 'village mentality' in startup ecosystems, especially in the early stages, believing healthy ecosystems should have founders helping each other and experienced individuals guiding newcomers.

Irish Startup Ecosystem: Challenges and Opportunities

Eamon expressed a desire for a more evolved ecosystem in Ireland, noting a lack of depth in exited founders reinvesting in new startups compared to other European cities. He distinguished between angel investors who are exited founders and those who made money in other ways, emphasizing the unique value of founder-angels.

Challenges in Ireland's Startup Ecosystem:

1. Imbalance between multinational tech companies and local startups
2. Potential over-reliance on government support
3. Need for more international exposure for Irish founders
4. Untapped potential for world-class companies

Baseline: A New Initiative for Irish Founders

Eamon introduced Baseline, a community and workspace he's creating for promising Irish founders. It's independent of government funding, funded by membership, private investors, and corporate/venture partners. Located in a space with a 10-year lease on Thomas Street, it aims to provide a collaborative environment for early-stage (pre-seed to Series A) founders, with the goal of improving the overall ecosystem over time.

Personal Startup Journey

Eamon shared his journey through various startups, including:

1. A developer consultant agency (2007)
2. A cloud deployment platform (sold after 7 months)
3. A professional network startup (technical success but commercial failure)
4. A cloud analytics startup (2009, timing too early for the market)
5. Bandless (2019), an employer of record company for international hiring

Current Projects:

1. Baseline: Local initiative for Irish founders
2. Conference in Switzerland: Global outreach project
3. Broadstone: Investment syndicate bridging local and global

Key Takeaways from Eamon's Experience:

1. Success doesn't guarantee future success; each startup is a new challenge.
2. Life events and personal struggles impact founder journeys significantly.
3. Building company culture requires understanding and accommodating people's personal challenges.
4. Timing is crucial in startup success; being too early can be the same as being wrong.
5. Balancing local and global initiatives can create a comprehensive approach to ecosystem building.

Gary's Insights and Advice for Entrepreneurs

1. Trust Your Gut: Gary emphasized the importance of trusting one's instincts in business, using his podcast as an example.

2. Be Open to Change: Gary identified this as his 'founder formula' for success, stressing the importance of adaptability.

3. Reading Recommendation: 'Simple Sabotage Field Manual,' a 1944 publication offering insights into organizational inefficiencies.

4. Self-Promotion Challenges: Gary advised Irish entrepreneurs to overcome cultural conditioning against self-promotion, especially when operating in cultures where it's expected.

5. Mental Health in Entrepreneurship: Gary acknowledged the toll of building a startup and emphasized the importance of building resilience and managing stress.

6. Investment Perspective: Gary expressed confidence in Tiple, praising their team's decisiveness and innovative approach.

7. Embracing Nuance: Gary advocated for less polarization and more nuance in thinking, both in business and life.

8. Trust Assessment: Gary shared his method for assessing trustworthiness in business relationships, considering what people say, what they do, and what others say about them.

9. Community Building: Through Baseline, Gary aims to create a supportive environment for founders to discuss challenges beyond just business metrics.

10. Personal Insight: Gary shared a personal moment, recalling his first date with Fiona Kelly, highlighting the importance of personal relationships amidst professional pursuits.

Throughout the conversation, both Eamon and Gary emphasized the value of experience, continuous learning, adaptability, and the importance of building strong, trustworthy relationships in the entrepreneurial journey. Their insights reflected a balanced approach to business, considering both practical strategies and personal well-being, while also highlighting the unique challenges and opportunities in the Irish startup ecosystem.

The discussion provided a rich tapestry of insights into entrepreneurship, from the power of intentional networking and event planning to the intricacies of pre-seed investments and ecosystem building. Eamon's experiences across multiple startups and his current initiatives like Baseline and Broadstone offer valuable lessons for aspiring entrepreneurs. Meanwhile, Gary's practical advice on trusting one's instincts, embracing change, and maintaining mental health provides a complementary perspective on navigating the entrepreneurial landscape.

The conversation underscored the importance of building genuine connections, whether through carefully curated events or supportive communities like Baseline. It also highlighted the cyclical nature of tech trends and the need for founders to stay adaptable and forward-thinking.

For the Irish startup ecosystem, the discussion pointed to both challenges and opportunities. While there's a need for more experienced founders to reinvest in the ecosystem and for Irish entrepreneurs to gain more international exposure, initiatives like Baseline are working to create a more supportive and dynamic environment for startups to thrive.

Ultimately, the podcast offered a comprehensive look at the multifaceted world of entrepreneurship, emphasizing that success comes not just from business acumen, but also from building strong relationships, maintaining personal well-being, and contributing to the broader ecosystem. As both Eamon and Gary demonstrated, the journey of an entrepreneur is one of continuous learning, adaptation, and community-building."
}